InformationRegisters/Б24_СМ_НастройкиСмартПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СМ_НастройкиСмартПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособСинхронизацииДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторенийПриОшибках</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьИзмененияАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВыполненияСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьОшибкиВоВремяСинхронизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_СМ_ТаблицаИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СМ_ТаблицаИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяЗаписиВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВладельцаСмартПроцесса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСмартПроцесса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСущности1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сущность1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_СМ_НастройкиСмартПроцессов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданаИзмененаНастройка" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	лПараметры = Новый Структура;
	лПараметры.Вставить("НастройкаПодключения", ВыбраннаяСтрока); 
	ОткрытьФорму("РегистрСведений.Б24_СМ_НастройкиСмартПроцессов.Форма.ФормаЗаписи", лПараметры);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		лПараметры = Новый Структура;
		лПараметры.Вставить("НастройкаПодключения", ТекущаяСтрока); 
		ОткрытьФорму("РегистрСведений.Б24_СМ_НастройкиСмартПроцессов.Форма.ФормаЗаписи", лПараметры);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо создать настройку подключения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизацию(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ПометкаУдаления") = Ложь Тогда
			
			Если НЕ НастройкаСинхронизацииСуществует(ТекущаяСтрока) Тогда
				ПоказатьПредупреждение(, "Не заданы настройки синхронизации",10);
				Возврат;
			КонецЕсли;
			
			Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
				ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НастройкаПодключения"	, ТекущаяСтрока);
			ПараметрыФормы.Вставить("ВидСинхронизации"		, 7);
			ПараметрыФормы.Вставить("ПолнаяСинхронизация"	, Ложь);
			
			ОткрытьФорму("РегистрСведений.Б24_СМ_НастройкиСмартПроцессов.Форма.ФормаВыполнениеСинхронизации", ПараметрыФормы, , ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолнуюСинхронизацию(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ПометкаУдаления") = Ложь Тогда
			
			Если НЕ НастройкаСинхронизацииСуществует(ТекущаяСтрока) Тогда
				ПоказатьПредупреждение(, "Не заданы настройки синхронизации",10);
				Возврат;
			КонецЕсли;
			
			Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
				ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НастройкаПодключения"	, ТекущаяСтрока);
			ПараметрыФормы.Вставить("ВидСинхронизации"		, 7);
			ПараметрыФормы.Вставить("ПолнаяСинхронизация"	, Истина);
			
			ОткрытьФорму("РегистрСведений.Б24_СМ_НастройкиСмартПроцессов.Форма.ФормаВыполнениеСинхронизации", ПараметрыФормы, , ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Функция НастройкаСинхронизацииСуществует(НастройкаПодключения)
	
	Возврат РегистрыСведений.Б24_СМ_НастройкиСмартПроцессов.ПолучитьМассивНастроекСинхронизации("НастройкаПодключения", НастройкаПодключения).Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ЗарегистрированныеИзменения(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПараметрыВыбора = Новый Структура("НастройкаПодключения", ТекущаяСтрока);
		ОткрытьФорму("РегистрСведений.Б24_СМ_ТаблицаИзменений.ФормаСписка", ПараметрыВыбора, ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторыЭлементов(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПараметрыВыбора = Новый Структура("НастройкаПодключения", ТекущаяСтрока);
		ОткрытьФорму("РегистрСведений.Б24_СМ_ИдентификаторыОбъектов.ФормаСписка", ПараметрыВыбора, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры
